[
  {
    "path": "lessons/2022-08-26-species-richness-rank-abundance-curves/",
    "title": "So Many Species, So Little Time: Calculating and Visualizing Biodiversity",
    "description": "We present a number of common metrics for quantifying biodiversity, their meaning, and how they can be visualized with the help of a Rank-Abundance curves",
    "author": [
      {
        "name": "Jory Griffith",
        "url": {}
      },
      {
        "name": "Egor Katkov",
        "url": {}
      },
      {
        "name": "Maggie Slein",
        "url": {}
      }
    ],
    "date": "2022-08-26",
    "categories": [],
    "contents": "\n\nContents\nTutorial Overview\nLearning objectives\nWhy biodiversity matters\nTypes of data typically collected\nWays to calculate diversity\nVisualizing species diversity\nRank abundance curves with simulated data\nRank abundance curves with Turkey lakes invertebrate data\nThe Data\n\ncodyn tutorial\nLoad Packages\nUsing the codyn package to analyze diversity data over time\nUsing community_structure()\nSpecies Richness and Evenness\n\nUsing community_diversity()\nShannon’s diversity\nSimpson’s diversity\n\nActivity\n\nReferences\n\nTutorial Overview\nBiodiversity is a hot topic in the fact of unprecedented global change in the 21st century. With a publicly available dataset, from the Turkey Lakes Watershed, we demonstrate how to quantify biodiversity quantitatively and visually using R.\nLearning objectives\nUtilizing historical data from a freshwater lake ecosystem, by the end of this tutorial you will be able to:\nIdentify, calculate, and implement commonly used metrics to quantify biodiversity\nUnderstand and create figures uses to display biodiversity data\nApply this concepts to other aspects of the dataset used in this tutorial\nFig. 1: Occurrences of species across the globe from the Global Biodiversity Information Facility (GBIF)Ecologists are often interested in the effects of perturbations (e.g. fires, logging, flooding or pollution) on biodiversity, which can yield information and context for ecosystem health. However, boiling biodiversity down to a single metric can be difficult and incomplete depending on the goal. With the help of the Turkey lake dataset of benthic invertebrates, we will present you with a number of common metrics to assess biodiversity, their meaning, and how they can be visualized with the help of Rank-Abundance curves.\nYou will then have the option to learn to calculate biodiversity metrics yourself using an R package called codyn.\nWhy biodiversity matters\nFig. 2: Importance of biodiversity for downstream effects on ecosystem success, structure, and function. Source: Figure 2, Loureau et al 2001, DOI: 10.1126/science.1064088In an ever-changing world, we are often concerned with how organisms will be able to cope with disturbances and increasingly, global climate change. Biodiversity is the variety of life at all levels, from genes to ecosystems. Not only is biodiversity important for ecosystems to function properly, it is also an important buffer to withstanding changing environments. When there is high biodiversity, there is a higher chance of some organisms surviving ecosystems that are changing due to disturbance or climate change. Biodiversity therefore increases the resiliency of these ecosystems and the likelihood that they will be able to persist beyond this change.\nTypes of data typically collected\nBiodiversity is a broad term, and can be difficult to quantify. Biologists have created several standard measures of biodiversity that convey different information about ecosystems and the species living there.\nFig. 3: Schematic of freshwater lake ecosystem demonstrating the different information biologists to collect to understand biodiversityOften times, biologists interested in collecting biodiversity data collect a standard set of responses. These often include:\nThe different kinds of species in a given area or environment\nThe number of individuals of each species (abundance)\nInformation about the area itself (i.e. habitat type, weather conditions, etc.)\nIf the work involves an setting up an experiment, collecting the control vs. experimental groups as well as metrics for replication and statistical power\nThe time frame over which the data were collected\nWays to calculate diversity\nOnce we have collected our biodiversity data, there are several different ways to analyse and understand changes in community composition, or the relative abundances of all taxa in a community. Each of these metrics allow us to look at different aspects of the biodiversity data we collect.\nSpecies richness quantifies the number of different species in a community.\nThe Shannon-Weiner Index estimates species diversity by taking into account the number of species living in a habitat (richness) and their relative abundance (evenness).\nSimpson’s Diversity Index also takes into account species richness and evenness, but puts more emphasis on rare species.\nThe Evenness Index assesses the evenness of the abundances of each species.\n\nThe Data\nTo explore these different diversity metrics and how they are calculated, we have simulated a biodiversity dataset with 10 unique species and random abundances across 3 years. This will allow us to look at how diversity changes over time.\nHere, we generated a simulated dataset of different abundances of species across 3 years. Each number in the species columnn represents a unique species, abundance is the number of individuals counted in a given year. Here is the first 6 rows in our simluated dataset.\n\n\nhide\n\npacman::p_load(tidyverse, patchwork)\nset.seed(222)\nsim1 <- data.frame(\n  species = sample(1:10, 20, replace=2), \n  abundance = sample(0:200, 20, replace=2), \n  year= 2001)\nset.seed(723)\nsim2 <- data.frame(\n  species = sample(1:10, 20, replace=2), \n  abundance = sample(0:200, 20, replace=2), \n  year= 2009)\nset.seed(117)\nsim3 <- data.frame(\n  species = sample(1:7, 20, replace=2), \n  abundance = sample(0:200, 20, replace=2), \n  year= 2020)\nsim <- rbind(sim1, sim2, sim3)\nhead(sim)\n\n  species abundance year\n1       2       149 2001\n2       7       104 2001\n3       8        42 2001\n4       6         8 2001\n5      10       191 2001\n6       4       196 2001\n\nHere is a look at the simulated data.\n\n\nhide\n\nsim %>%\n  ggplot(aes(x=as.factor(species), y=abundance, fill=as.factor(year)))+\n  geom_col(position=\"dodge\")+\n  scale_fill_viridis_d(name=\"Year\")+\n  theme_bw()+\n  #coord_flip()+\n  xlab(\"Species\")\n\n\nhide\n\n  #facet_wrap(~year)\n\n\nFigure 1. Simulated species abundances for 3 different years and 10 different species. Bar are the abundances of the species, coloured by year.\nWe can see that this data is quite messy and hard to find clear patterns in changes across species, abundance, and years. Below are metrics we can use to better define and clarify these patterns.\nSpecies richness\nPerhaps the simplest measure of biodiversity is species richness (\\(S\\)).\nThe equation for species richness is:\n\\(S = \\sum_{i=1}^{S}p_i^o\\)\n(Describe what the variables mean).\nStep 1: Count the number of unique species recorded in that year. Then you can look at how the number of different species in a community changes over time.\nInterpretation: A higher number means there are more species, and therefore species richness is higher.\n\n\nhide\n\npacman::p_load(codyn, kableExtra)\n#table just showing the number of unique species\n#species richness calcs i used to manually enter below\nrichness_table <- sim %>%\n  group_by(time) %>%\n  summarise(richness=length(unique(species)))\n\nError in `group_by()`:\n! Must group by variables found in `.data`.\n✖ Column `time` is not found.\n\nhide\n\n#we should probably make this into a nice looking kable?\nkable(richness_table, col.names=c(\"Year\", \"Richness\"), align=\"c\")%>%\n  kable_classic(full_width = F, html_font = \"Cambria\")\n\nError in kable(richness_table, col.names = c(\"Year\", \"Richness\"), align = \"c\"): object 'richness_table' not found\n\nWe can see in this table that across years, the number of species in the same area fluctuated, some years with more species, other years with less.\nShannon-Wiener Index (H)\nAnother metric we can use to analyze biodiversity is the Shannon-Wiener Index (\\(H\\)), which indexes across the sum of all relative proportions of species richness’s with an additional logarithmic transformation. This equation uses both the number of species in a specific area (richness) and relative abundance (evenness).\nThe equation for the Shannon-Weiner Index is:\n\\(H = - \\sum_{i=1}^{S}p_ilnp_i\\)\nStep 1: Calculate \\(p_i\\), which is the proportion of \\(i\\)th individuals in the community.\n\\(p_i = n_i/N\\)\nWhere \\(n_i\\) is the number of individuals in the ith species and and \\(N\\) is the total number of individuals in the community.\nStep 2: Multiply the proportion of each species (\\(p_i\\)) by the logarithm of the proportion (\\(lnp_i\\))\nStep 3: Sum each of these values for each species.\nStep 5: Multiply the sum by -1.\nInterpretation: The minimum value of the Shannon’s diversity index is 0, which means that there is no diversity (i.e. only one species is found in that habitat). The values increase as the number of species increase, and is maximized at a given number of species when is an equal abundance of each species.\n\n\nhide\n\nshannon <-  sim %>%\n    group_by(time, species) %>%\n    summarise(n=n()) %>%\n    mutate(prop = n/sum(n),\n    shannon= sum(prop/log(prop))) %>%\n    summarise(shannon = mean(shannon))\n\nError in `group_by()`:\n! Must group by variables found in `.data`.\n✖ Column `time` is not found.\n\nhide\n\nkable(shannon, col.names=c(\"Year\", \"Shannon's Index\"), align=\"c\")%>%\n  kable_classic(full_width = F, html_font = \"Cambria\")\n\nError in kable(shannon, col.names = c(\"Year\", \"Shannon's Index\"), align = \"c\"): object 'shannon' not found\n\nFrom our simulated dataset, we can see that the Shannon diversity increases over time.\nSimpson’s Index (D)\nAnother metric we can use to analyse biodiversity in the Simpson’s index (\\(D\\)) which indexes across the sum of all relative proportions of species’s richness with an additional square power transformation. Though very similar to the calculation in the Shannon-Wiener Index, the Simpson index is more focused on dominance of species as it highlights the proportion of species in a sample.\nThe equation for Simpson’s diversity is:\n\\(D = 1-(\\sum n_i(n_i-1))/N(N-1))\\)\nWhere \\(n\\) is the number of individuals of the ith species and \\(N\\) is the total number of individuals in the community.\nStep 1: Multiply the number of individuals of a given species (\\(n_i\\)) by (\\(n_i-1\\)).\nStep 2 Multiply the total number of individuals in the community (\\(N\\)) by (\\(N-1\\)).\nStep 3: Divide the number from step 1 by the number from step 2.\nStep 4: Once you have a number from step 3 for each species in the community, sum all of these together.\nInterpretation: The higher the value of \\(D\\), the greater the diversity in the community. An index close to 1 means that there are several species in the community, and the population proportion of species is even.\n\n\nhide\n\nsimpson<-  sim %>%\n    group_by(time, species) %>%\n    summarise(n=n()) %>%\n    mutate(prop = n/sum(n),\n    simpson = sum((prop)^2)) %>%\n    summarise(simpson = mean(simpson))\n\nError in `group_by()`:\n! Must group by variables found in `.data`.\n✖ Column `time` is not found.\n\nhide\n\nkable(simpson, col.names=c(\"Year\", \"Simpson's Index\"), align=\"c\")%>%\n  kable_classic(full_width = F, html_font = \"Cambria\")\n\nError in kable(simpson, col.names = c(\"Year\", \"Simpson's Index\"), align = \"c\"): object 'simpson' not found\n\nThe Simpson index increases over time, which tells us that by this measure, biodiversity is increasing.\nEvenness Index (E)\nAdditionally, we can think about the evenness of species across a given area. Evenness is a metric for assessing species dominance. If evenness is high, it means most species are of equal dominance. If evenness if low, it means some species are more dominant (i.e. have higher abundance) than others. Evenness is maximized when all species have equal abundances.\nThe equation for species evenness is:\n\\(E = H / ln(S)\\)\nStep 1: Divide the value of the Shannon-Wiener index (\\(H\\)) by the species richness (\\(S\\)).\nInterpretation: Values closer to one signify more evenness and values closer to 0 signify lower evenness.\n\n\nhide\n\nevenness<-  sim %>%\n    group_by(time, species) %>%\n    summarise(n=n()) %>%\n    mutate(richness= case_when(time %in% c(\"2001\", \"2009\") ~ 9, \n                             TRUE~ 7),\n           prop = n/sum(n),\n    shannon= sum(prop/log(prop)), \n    evenness = shannon/log(richness)) %>%\n    summarise(evenness = mean(evenness))\n\nError in `group_by()`:\n! Must group by variables found in `.data`.\n✖ Column `time` is not found.\n\nhide\n\nkable(evenness, col.names=c(\"Year\", \"Evenness\"), align=\"c\")%>%\n  kable_classic(full_width = F, html_font = \"Cambria\")\n\nError in kable(evenness, col.names = c(\"Year\", \"Evenness\"), align = \"c\"): object 'evenness' not found\n\nIn our simulated dataset, we can see that evenness is low from the start and increases over time, suggesting that species abundances are becoming more even.\n\nVisualizing species diversity\nRank abundance curves with simulated data\nOne way to visualize biodiversity data is to make a Rank Abundance Curve (RAC). On the y-axis we have the species (numbered), and on the y axis we have the abundance. The plots are organized from high to low abundance. Using RACs, we can visualize the change in relative abundance and species dominance over time.\n\n\nhide\n\nlibrary(tidyverse, viridis)\n# Code or exercise on calculating species richness?\n#before \npacman::p_load(tidyverse, patchwork)\ndata_2007 <- data.frame(\n  species = c(1,2,3,4,5,6), \n  abundance = c(77, 109, 24, 38, 11, 6),\n  time= 2007)\n\ndata_2018 <- data.frame(\n  species = c(1,2,3,4,5,6), \n  abundance = c(47, 79, 2, 15, 169, 111),\n  time= 2018)\n\ndata <- rbind(data_2007, data_2018) %>%\n  group_by(species, time) %>%\n  summarise(abundance= sum(abundance))\n\n\n#2007\na<- data %>%\n  filter(time==2007) %>%\nggplot( aes(x=reorder(species, -abundance), y=abundance, shape=as.factor(species), colour=as.factor(species)))+\n  geom_point(size=4)+\n  scale_colour_viridis_d()+\n  ggtitle(\"2007\")+\n  labs(x=\"Species\", y=\"Abundance\")+\n  theme_classic()+\n  theme(legend.position=\"none\")+\n  labs(x=\"Species\", y=\"Abundance\", color=\"Species\")\n\n#2007\nb<- data %>%\n  filter(time==2018) %>%\nggplot(aes(x=reorder(species, -abundance), y=abundance, shape=as.factor(species),  colour=as.factor(species)))+\n  geom_point(size=4)+\n  scale_colour_viridis_d()+\n  ggtitle(\"2018\")+\n  labs(x=\"Species\", y=\"Abundance\")+\n  theme_classic()+\n  theme(legend.position=\"none\")+\n  labs(x=\"Species\", y=\"Abundance\", color=\"Species\")\n\na / b\n\n\n\nWe can see here between 2007 and 2018 in our simulated community, there were differences in absolute abundance as well as which species were dominant, which species disappeared, and which species were new. For instance, in 2007, species 2 was the most abundant species, but it 2018, it was the 3rd most abundant species. However, species 3 is lost by 2018, while species 6 is gained in 2018.\nThis where I couldn’t seem to get the second panel set to show up\nRank abundance curves with Turkey lakes invertebrate data\nThe Data\nThe Turkey Lakes watershed is located in Ontario, Canada, approximately 50km North of Sault Ste. Marie. It is 10\\(km^2\\) in area and contains a chain of 4 lakes. The Turkey Lakes Watershed Study (see map) is an initiative by several agencies of the government of Canada, initially designed to study the effects of acid rain on forest ecosystems.\nFrom 1995 to 2009, scientists collected, identified and counted benthic invertebrates from various stream beds around the Turkey Lakes catchment.\nBenthic invertebrates are small, often microscopic organisms (see Fig. 1), but form an important link between aquatic and terrestrial habitats .\nThey can decompose terrestrial matter such as leaves, or consume periphyton (algae and cyanobacteria) growing on rocks within their streams.\nBenthic invertebrates can be a food source for aquatic animals, like small fish, or terrestrial animals such as birds.\nAn experiment was conducted in 1997 where certain sampling sites experienced different levels of logging intensity.\nDue to their interaction with the terrestrial realm, we can hypothesize that the biodiversity of benthic invertebrate communities might be affected by logging.\nFig. 1: Various benthic macroinvertebrates under a stereo microscope. Source: G. Carter via NOAA/GLERL\n\nhide\n\npacman::p_load(leaflet)\n\nleaflet() %>%\n  addTiles() %>%  # Add default OpenStreetMap map tiles\n  addMarkers(lng=-84.4110, lat=47.0515, popup=\"Turkey Lakes\") %>%\n  setView(lng=-84.4110, lat=47.0515, zoom=2)\n\n\n\nFigure 2. Interactive map of the Turkey Lakes study site\n\nLoad Data\nThese data are from the Turkey Lakes watershed experiment. This dataset contains the abundances of benthic invertebrate species measured in the May and June from 1995 to 2001. They recorded the type and number of invertebrates in an area of the stream, with 10 replicates per sampling event. These forests next to these streams were logged in 1997 with varying harvest intensities, with low, medium, and high intensity harvest and a control stream with no forest harvest. We will using the codyn package to analyze the diversity of these benthic invertebrates over time.\n\n\nhide\n\ndata<-read.csv(\"stream_invertebrates.csv\")\nhead(data)\n\n  year   species treatment replicate abundance\n1 1995 Alloperla   control         1         0\n2 1995 Alloperla   control         2         0\n3 1995 Alloperla   control         3         4\n4 1995 Alloperla   control         4         3\n5 1995 Alloperla   control         5         3\n6 1995 Alloperla   control         6         3\n\nRaw data\nRACs in nature are rarely as evenly distributed as the simulated data.\nThere is often few highly abundant species and many very rare species.\nBelow, you can see the rank-abundance distribution from one of the catchments in our Turkey Lakes benthic invertebrate dataset from the year following logging treatments (1998).\n\n\nhide\n\nsource(\"R/RankAbundance/plotRankAbundance.R\") \nyr = 1998\nplotRankAbundance(log=F,\n                  select_catchment = c(\"34M\",  \"34U\",    \"34L\"),     \n                  select_year      = c(yr,yr),     \n                  select_month     = c(\"june\"))\n\n\n\nLog transformed data\nTo better visualize the distribution, the y-axis is typically log-transformed\n\n\nhide\n\nplotRankAbundance(log=T,\n                  select_catchment = c(\"34M\",  \"34U\",    \"34L\"),     \n                  select_year      = c(yr,yr),     \n                  select_month     = c(\"june\"))\n\n\n\nRank\nBecause most classic metrics of biodiversity do not take the species identity into account, we can drop species names from the x-axis, and simply refer to it’s rank in the community. This is where the term rank-abundance comes from.\n\n\nhide\n\nplotRankAbundance(log=T,\n                  select_catchment = c(\"34M\",  \"34U\",    \"34L\"),     \n                  select_year      = c(yr,yr),     \n                  select_month     = c(\"june\"), \n                  SpName           = F)\n\n\n\nCurve\nFinally, instead of using bars to represent abundances, we can simply use lines to trace the distribution. This allows us to compare multiple distributions, in this case, from different three different sites with three levels of logging intensity.\n\n\nhide\n\nsource(\"R/RankAbundance/plotRAC.R\")\ndf <- rankSpecies() %>% \n  filter(year==yr) \nComparisonPlot = df %>%\n  plotRAC(facets = F) +  theme(legend.position = c(0.87,0.87))\nComparisonPlot\n\n\n\nSpecies Richness\nWe can compare species richness by comparing the maximum rank.\n\n\nhide\n\ndfRank = df %>% \n  filter(TotalCount > 0)\nannotations = dfRank %>% summarise(maxRank = max(Rank))\n\nannotations$xend = c(40, 31, 34)\nannotations$yend = rep(1, 3)\nannotations$x    = annotations$xend + 3\nannotations$y    = rep(5, 3)\n\nComparisonPlot + \n  geom_segment(data = annotations, aes(yend=yend, xend=xend, x=x, y=y), size=1.2, arrow = arrow(), show.legend = FALSE) + \n  geom_text(data = annotations, aes(x = x+1, y=y+2, label=maxRank), size=6, show.legend = FALSE) \n\n\n\nEveness\nThe biodiversity metrics described (Shannon, Simpson, etc.) also incorporate community evenness, which can be thought of as the slope of rank-abundance curve.\nFor example, a community with one very dominant species and a rapid drop-off in species abundance will have a lower evenness than a community where more species are common.\nIn the plot below, the community at the site of “medium” logging (orange) is less even than the other two since it has a steeper average slope.\n\n\nhide\n\nq = {ComparisonPlot +  geom_smooth(method=lm, se=FALSE, data=dfRank) }%>%\n  ggplot_build()\nq$data[[1]]$alpha = 0.5\n\nggplot_gtable(q) %>% \n  plot \n\n\n\nSeveral models have been developed to understand rank-abundance curves (e.g. log-normal, broken stick model).\nThe radfit function from the vegan R package allows fitting of these different curve models (see https://search.r-project.org/CRAN/refmans/vegan/html/radfit.html)\n\ncodyn tutorial\nLoad Packages\nWe will be using the codyn package for this tutorial. We will also use ggplot2 and dplyr for plotting and cleaning.\n\n\nhide\n\nlibrary(ggplot2)\nlibrary(codyn)\nlibrary(dplyr)\n\n\nFor many functions, the codyn package can only look at data from one stream at a time. So first we will separate each stream into it’s own data frame.\n\n\nhide\n\n# high intensity logging treatment\nsubset_codyn_high <- data %>%\n  filter(treatment == \"high\")\n# medium intensity logging treatment\nsubset_codyn_med <- data %>%\n  filter(treatment == \"medium\")\n# low intensity logging treatment\nsubset_codyn_low <- data %>%\n  filter(treatment == \"low\") \n# control stream (no logging)\nsubset_codyn_ctrl <- data %>%\n  filter(treatment==\"control\")\n\n\nUsing the codyn package to analyze diversity data over time\nEcologists are often interested in how diversity changes over time in one place. This is particularly interesting when you are looking at how species diversity responds to environmental change. This environmental change can be a single disturbance event such as a forest fire or more long-term change such as temperature increases due to climate change. The Turkey Lakes dataset provides us with an opportunity to look at how the diversity of benthic invertebrates changes over time and in response to logging. We can compare the diversity of different streams with different logging intensities and we can also compare the diversity of streams.\nThe codyn package allows us to analyze the change in biodiversity over time using different metrics.\nUsing community_structure()\ncommunity_structure() is a function in the package codyn that calculates species richness and evenness.\nSpecies Richness and Evenness\nFor example, we can use community_structure() to look at the change in species richness and evenness over time in one of the Turkey Lake streams. We will choose the stream with high logging intensity as an example. This function can only look at one stream at a time so make sure to subset out the stream that you are interested in.\nLet’s take a look at the high intensity logging stream data.\n\n\nhide\n\nhead(subset_codyn_high)\n\n  year     species treatment replicate abundance\n1 1995 Amphinemura      high         1         9\n2 1995 Amphinemura      high         2        24\n3 1995 Amphinemura      high         3        53\n4 1995 Amphinemura      high         4        15\n5 1995 Amphinemura      high         5        59\n6 1995 Amphinemura      high         6        37\n\nAs you can see, there is a column for year, species, replicate, and abundance.\nThe community structure function has five arguments.\n1. df is where you put in the data frame of interest, in our case subset_codyn_high.\n2. The time.var argument is where you put in your time variable (year)\n3. The abundance.var argument is where you put the column that holds the abundance variable (abundance).\n4. The replicate.var argument holds the column with the replicates (replicate)\n5. The metric argument allows you to specify the metric of evenness that you want the function to calculate. There are three possible metrics: Evar, SimpsonEvenness, and EQ, which all calculate evenness in different ways. We will use Simpson’s Evenness in this tutorial.\nRemember, if you ever need a refresher on the syntax you can type ?community_structure into the R script.\n\n\nhide\n\nrichness_high<-community_structure(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\", replicate.var=\"replicate\", metric=\"SimpsonEvenness\")\n\n\nWe can take a look at the output.\n\n\nhide\n\nhead(richness_high)\n\n  year replicate richness SimpsonEvenness\n1 1995         1       17       0.2210248\n2 1996         1       11       0.5785671\n3 1997         1       16       0.3436584\n4 1998         1       18       0.2786702\n5 1999         1       15       0.3540228\n6 2001         1       23       0.2661854\n\nAs you can see, this returns a data frame with the year, replicate, richness calculation, and evenness measure. It calculates richness and evenness separately for each replicate sample in the stream, so we have a measure of variability within samples as well as variability across years.\nPlot species richness\nWe can plot this data frame to see the changes over time.\n\n\nhide\n\nggplot()+\n  geom_point(richness_high, mapping=aes(x=year, y=richness))+\n  theme_classic()+\n  labs(y=\"Species Richness\", x=\"Year\")+\n  geom_vline(xintercept=1997, linetype=2, color=\"red\")\n\n\n\nFigure Species richness of aquatic macroinvertebrates over time. Each point is a replicate.\nHere is a plot of species richness, with a different value for each replicate. The red line is the year that the streams were logged. Do you see any change? Do you think there are any significant patterns? How does the variability between replicates compare to the variability between years?\nPlot species evenness\nWe can also plot species evenness over time.\n\n\nhide\n\nggplot()+\n  geom_point(richness_high, mapping=aes(x=year, y=SimpsonEvenness))+\n  theme_classic()+\n  labs(y=\"Simpson's Evenness\", x=\"Year\")+\n  geom_vline(xintercept=1997, linetype=2, color=\"red\")\n\n\n\nFigure Species evenness of aquatic macroinvertebrates over time. Each point is a replicate.\nDo you see any patterns in the evenness between years?\nUsing community_diversity()\nShannon’s diversity\nSpecies richness and evenness are very simple ways to look at species diversity. However, as you learned from the rank abundance curves, species have different abundances within the community, with some species having very high abundance and most species having low abundance. Species richness does not take into account the relative abundances of each species, which limits the inferences we can make. The Shannon-Weiner diversity metric does take into account these relative abundances when calculating the diversity of a community and allows us to make more meaningful inferences about how biodiversity is changing over time.\nThe codyn package allows you to calculate the Shannon diversity index for a single site over time using the community_diversity() function. We will again use the data from the stream with the high logging intensity. Luckily, this function has the exact same syntax as the community_structure() function! The only difference is that the options for the metric argument are Shannon and InverseSimpson. We will first use Shannon.\n\n\nhide\n\nshannon_div_high<-community_diversity(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\", replicate.var=\"replicate\", metric=\"Shannon\")\n\n\nLet’s take a look at the output for this function.\n\n\nhide\n\nhead(shannon_div_high)\n\n  year replicate  Shannon\n1 1995         1 1.836002\n2 1996         1 2.044210\n3 1997         1 2.107977\n4 1998         1 2.016146\n5 1999         1 1.948510\n6 2001         1 2.297970\n\nYou can see it gives us a data frame of year, replicate, and Shannon, which is our measure of Shannon diversity.\nPlot Shannon’s diversity\nWe can plot these to see change over time.\n\n\nhide\n\nggplot()+\n  geom_point(shannon_div_high, mapping=aes(x=year, y=Shannon))+\n  theme_classic()+\n  labs(y=\"Shannon Diversity\", x=\"Year\")+\n  geom_vline(xintercept=1997, linetype=2, color=\"red\")\n\n\n\nFigure Shannon’s diversity of aquatic macroinvertebrates over time. Each point is a replicate.\nSimpson’s diversity\nWe can also use the same function to calculate Simpson’s diversity by simply changing the metric argument to InverseSimpson.\n\n\nhide\n\nsimpson_div_high<-community_diversity(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\", replicate.var=\"replicate\", metric=\"InverseSimpson\")\n\n\nWe can look at the output.\n\n\nhide\n\nhead(simpson_div_high)\n\n  year replicate InverseSimpson\n1 1995         1       3.757421\n2 1996         1       6.364238\n3 1997         1       5.498534\n4 1998         1       5.016063\n5 1999         1       5.310341\n6 2001         1       6.122265\n\nPlot Simpson’s diversity\nAnd then plot.\n\n\nhide\n\nggplot()+\n  geom_point(simpson_div_high, mapping=aes(x=year, y=InverseSimpson))+\n  theme_classic()+\n  labs(y=\"Simpson Diversity\", x=\"Year\")+\n  geom_vline(xintercept=1997, linetype=2, color=\"red\")\n\n\n\nFigure Simpson’s diversity of aquatic macroinvertebrates over time. Each point is a replicate.\nHow do these patterns compare to the patterns of Shannon’s diversity over time? How do the values compare?\nActivity\nCalculate richness, evenness, and diversity using both the Shannon and Simpson indices for the streams with low intensity logging, high intensity logging, and no logging. The data for these streams are subset_codyn_low, subset_codyn_high, and subset_codyn_ctrl. Plot these indices. Do you see any patterns across years? How do these compare to the patterns in the high intensity logging stream?\nReferences\nI got the equations from this paper: DOI:10.1007/s10531-016-1261-0\n\n\n\n",
    "preview": "lessons/2022-08-26-species-richness-rank-abundance-curves/distill-preview.png",
    "last_modified": "2022-10-16T14:21:37-07:00",
    "input_file": "species-richness-rank-abundance-curves.knit.md"
  },
  {
    "path": "lessons/2022-06-03-chronic-wasting-disease/",
    "title": "Alberta Chronic Wasting Disease Tutorial",
    "description": "This interactive tutorial explores how a simple compartmental model (the SI model) can be used to track and predict the spread of Chronic Wasting Disease (CWD) in Albertan mule deer over time. It begins by introducing CWD and why it is a growing problem in Albertan mule deer. It then investigates and explains how different levels of transmission, death, and culling can change disease dynamics. Students can test how these different parameters influence the spread of CWD using the sliders on each page.",
    "author": [
      {
        "name": "Amy Forsythe",
        "url": {}
      },
      {
        "name": "Bryn Wiley",
        "url": {}
      }
    ],
    "date": "2022-06-03",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-09-01T13:05:38-04:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-alberta-trees-tutorial/",
    "title": "Alberta Trees Tutorial",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jhoan Chavez",
        "url": {}
      },
      {
        "name": "Zihaohan Sang",
        "url": {}
      },
      {
        "name": "Rolando Trejo Pérez",
        "url": {}
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-09-01T13:05:36-04:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-anticosti-historical-data-tutorial/",
    "title": "Anticosti Historical Data Tutorial",
    "description": "After the storm: Impacts of a hemlock looper outbreak on tree species in Anticosti Island, 1973",
    "author": [
      {
        "name": "Victoria Marie Glynn",
        "url": "mailto:victoria.glynn@mail.mcgill.ca"
      },
      {
        "name": "Maxime Fraser Franco",
        "url": "mailto:fraser_franco.maxime@courrier.uqam.ca"
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\nThis tutorial uses a tree damage dataset from Anticosti Island during\na hemlock looper outbreak in 1973. The dataset can be found on the\ngovernment of Canada’s official data\nportal. We would like to thank Anne Cotton-Gagnon, MSc, and\nChristian Hébert, PhD, from Natural Resources Canada and the Laurentian\nForestry Centre for their insights on the original datasets and access\nto the reports and maps associated with such.\nThe tutorial was built with the free and open-source software\nenvironment R using the leanr package and and\ndeployed using Shiny. You can\nfind the project folders and files in this GitHub\nrepository.\nThe present tutorial was developed by Victoria Marie Glynn who is a\nPhD student at McGill University in Montréal, Québec, and Maxime Fraser\nFranco who is a PhD student at the Université du Québec à Montréal\n(UQAM) in Montréal, Québec. Please feel free to contact us if you have\nany question (you can do that by clicking on our names on this page\nheader).\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2022-09-01T13:05:36-04:00",
    "input_file": {}
  },
  {
    "path": "lessons/2022-04-07-codyn-tutorial/",
    "title": "Codyn Tutorial",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Jory Griffith",
        "url": {}
      },
      {
        "name": "Maggie Slein",
        "url": {}
      },
      {
        "name": "Egor Katkov",
        "url": {}
      }
    ],
    "date": "2022-04-07",
    "categories": [],
    "contents": "\n\nContents\nLoad Packages\nLoad Data\nUsing\nthe codyn package to analyze diversity data over\ntime\nUsing\ncommunity_structure()\nSpecies Richness and\nEvenness\nPlot species richness\nPlot species evenness\n\n\nUsing\ncommunity_diversity()\nShannon’s diversity\nPlot Shannon’s diversity\n\nSimpson’s diversity\nPlot Simpson’s diversity\n\n\nActivity\n\nLoad Packages\nWe will be using the codyn package for this tutorial. We\nwill also use ggplot2 and dplyr for plotting\nand cleaning.\n\n\nlibrary(ggplot2)\nlibrary(codyn)\nlibrary(dplyr)\n\n\n\nLoad Data\nThese data are from the Turkey Lakes watershed experiment. This\ndataset contains the abundances of benthic invertebrate species measured\nin the May and June from 1995 to 2001. They recorded the type and number\nof invertebrates in an area of the stream, with 10 replicates per\nsampling event. These forests next to these streams were logged in 1997\nwith varying harvest intensities, with low, medium, and high intensity\nharvest and a control stream with no forest harvest. We will using the\ncodyn package to analyze the diversity of these benthic\ninvertebrates over time.\n\n\ndata<-read.csv(\"stream_invertebrates.csv\")\nhead(data)\n\n\n  year   species treatment replicate abundance\n1 1995 Alloperla   control         1         0\n2 1995 Alloperla   control         2         0\n3 1995 Alloperla   control         3         4\n4 1995 Alloperla   control         4         3\n5 1995 Alloperla   control         5         3\n6 1995 Alloperla   control         6         3\n\nFor many functions, the codyn package can only look at\ndata from one stream at a time. So first we will separate each stream\ninto it’s own data frame.\n\n\n# high intensity logging treatment\nsubset_codyn_high <- data %>%\n  filter(treatment == \"high\")\n# medium intensity logging treatment\nsubset_codyn_med <- data %>%\n  filter(treatment == \"medium\")\n# low intensity logging treatment\nsubset_codyn_low <- data %>%\n  filter(treatment == \"low\") \n# control stream (no logging)\nsubset_codyn_ctrl <- data %>%\n  filter(treatment==\"control\")\n\n\n\nUsing\nthe codyn package to analyze diversity data over time\nEcologists are often interested in how diversity changes over time in\none place. This is particularly interesting when you are looking at how\nspecies diversity responds to environmental change. This environmental\nchange can be a single disturbance event such as a forest fire or more\nlong-term change such as temperature increases due to climate change.\nThe Turkey Lakes dataset provides us with an opportunity to look at how\nthe diversity of benthic invertebrates changes over time and in response\nto logging. We can compare the diversity of different streams with\ndifferent logging intensities and we can also compare the diversity of\nstreams.\nThe codyn package allows us to analyze the change in\nbiodiversity over time using different metrics.\nUsing\ncommunity_structure()\ncommunity_structure() is a function in the package\ncodyn that calculates species richness and evenness.\nSpecies Richness and\nEvenness\nFor example, we can use community_structure() to look at\nthe change in species richness and evenness over time in one of the\nTurkey Lake streams. We will choose the stream with high logging\nintensity as an example. This function can only look at one stream at a\ntime so make sure to subset out the stream that you are interested\nin.\nLet’s take a look at the high intensity logging stream data.\n\n\nhead(subset_codyn_high)\n\n\n  year     species treatment replicate abundance\n1 1995 Amphinemura      high         1         9\n2 1995 Amphinemura      high         2        24\n3 1995 Amphinemura      high         3        53\n4 1995 Amphinemura      high         4        15\n5 1995 Amphinemura      high         5        59\n6 1995 Amphinemura      high         6        37\n\nAs you can see, there is a column for year, species, replicate, and\nabundance.\nThe community structure function has five arguments. The first is\ndf where you put in the data frame of interest, in our case\nsubset_codyn_high. The time.var argument is\nwhere you put in your time variable (year), the\nabundance.var argument is where you put the column that holds the\nabundance variable (abundance) and the\nreplicate.var argument holds the column with the replicates\n(replicate). In the metric argument, you can\nspecify the metric of evenness that you want the function to calculate.\nThere are three possible metrics: Evar,\nSimpsonEvenness, and EQ, which all calculate\nevenness in different ways. We will use Simpson’s Evenness in this\ntutorial. Remember, if you ever need a refresher on the syntax you can\ntype ?community_structure into the R script.\n\n\nrichness_high<-community_structure(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\",\n                                   replicate.var=\"replicate\", metric=\"SimpsonEvenness\")\n\n\n\nWe can take a look at the output.\n\n\nhead(richness_high)\n\n\n  year replicate richness SimpsonEvenness\n1 1995         1       17       0.2210248\n2 1996         1       11       0.5785671\n3 1997         1       16       0.3436584\n4 1998         1       18       0.2786702\n5 1999         1       15       0.3540228\n6 2001         1       23       0.2661854\n\nAs you can see, this returns a data frame with the year, replicate,\nrichness calculation, and evenness measure. It calculates richness and\nevenness separately for each replicate sample in the stream, so we have\na measure of variability within samples as well as variability across\nyears.\nPlot species richness\nWe can plot this data frame to see the changes over time.\n\n\n\nHere is a plot of species richness, with a different value for each\nreplicate. The red line is the year that the streams were logged. Do you\nsee any change? Do you think there are any significant patterns? How\ndoes the variability between replicates compare to the variability\nbetween years?\nPlot species evenness\nWe can also plot species evenness over time.\n\n\n\nDo you see any patterns in the evenness between years?\nUsing\ncommunity_diversity()\nShannon’s diversity\nSpecies richness and evenness are very simple ways to look at species\ndiversity. However, as you learned from the rank abundance curves,\nspecies have different abundances within the community, with some\nspecies having very high abundance and most species having low\nabundance. Species richness does not take into account the relative\nabundances of each species, which limits the inferences we can make. The\nShannon-Weiner diversity metric does take into account these relative\nabundances when calculating the diversity of a community and allows us\nto make more meaningful inferences about how biodiversity is changing\nover time.\nThe codyn package allows you to calculate the Shannon\ndiversity index for a single site over time using the\ncommunity_diversity() function. We will again use the data\nfrom the stream with the high logging intensity. Luckily, this function\nhas the exact same syntax as the community_structure()\nfunction! The only difference is that the options for the\nmetric argument are Shannon and\nInverseSimpson. We will first use Shannon.\n\n\nshannon_div_high<-community_diversity(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\",\n                                      replicate.var=\"replicate\", metric=\"Shannon\")\n\n\n\nLet’s take a look at the output for this function.\n\n\nhead(shannon_div_high)\n\n\n  year replicate  Shannon\n1 1995         1 1.836002\n2 1996         1 2.044210\n3 1997         1 2.107977\n4 1998         1 2.016146\n5 1999         1 1.948510\n6 2001         1 2.297970\n\nYou can see it gives us a data frame of year,\nreplicate, and Shannon, which is our measure\nof Shannon diversity.\nPlot Shannon’s diversity\nWe can plot these to see change over time.\n\n\nggplot()+\n  geom_point(shannon_div_high, mapping=aes(x=year, y=Shannon))+\n  theme_classic()+\n  labs(y=\"Shannon Diversity\", x=\"Year\")+\n  geom_vline(xintercept=1997, linetype=2, color=\"red\")\n\n\n\n\nSimpson’s diversity\nWe can also use the same function to calculate Simpson’s diversity by\nsimply changing the metric argument to\nInverseSimpson.\n\n\nsimpson_div_high<-community_diversity(df=subset_codyn_high, time.var=\"year\", abundance.var=\"abundance\",\n                                      replicate.var=\"replicate\", metric=\"InverseSimpson\")\n\n\n\nWe can look at the output.\n\n\nhead(simpson_div_high)\n\n\n  year replicate InverseSimpson\n1 1995         1       3.757421\n2 1996         1       6.364238\n3 1997         1       5.498534\n4 1998         1       5.016063\n5 1999         1       5.310341\n6 2001         1       6.122265\n\nPlot Simpson’s diversity\nAnd then plot.\n\n\n\nHow do these patterns compare to the patterns of Shannon’s diversity\nover time? How do the values compare?\nActivity\nCalculate richness, evenness, and diversity using both the Shannon\nand Simpson indices for the streams with low intensity logging, high\nintensity logging, and no logging. The data for these streams are\nsubset_codyn_low, subset_codyn_high, and\nsubset_codyn_ctrl. Plot these indices. Do you see any\npatterns across years? How do these compare to the patterns in the high\nintensity logging stream?\n\n\n\n",
    "preview": "lessons/2022-04-07-codyn-tutorial/codyn-tutorial_files/figure-html5/unnamed-chunk-7-1.png",
    "last_modified": "2022-09-01T13:05:37-04:00",
    "input_file": {}
  }
]
